/*
                                    Самойлов Р.А.
5.
а) Написать программу, которая выводит на экран ваше имя, фамилию и город проживания.
б) Сделать задание, только вывод организовать в центре экрана.
в) *Сделать задание б с использованием собственных методов (например, Print(string ms, int x,int y).
 */

//Вариант: a)

string firstName = "Роман";
string lastName = "Самойлов";
string city = "Уфа";

Console.WriteLine($"Имя: {firstName}, Фамилия: {lastName}, Город: {city}");